tap "adoptopenjdk/openjdk"
tap "artsy/formulas"
tap "denisidoro/tools"
tap "elastic/tap"
tap "git-duet/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "olafurpg/scalafmt"
tap "rbenv/tap"
tap "thoughtbot/formulae"
tap "vapor/tap"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "aws-iam-authenticator"
brew "gdbm"
brew "python@3.9", link: false
brew "awscli"
brew "bison"
brew "glib"
brew "openjdk"
brew "clojure"
brew "libssh2"
brew "curl"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "elm"
brew "exercism"
brew "folly"
brew "gdk-pixbuf"
brew "geckodriver"
brew "git"
brew "git-delta"
brew "git-standup"
brew "nghttp2"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "python@3.10"
brew "httpie"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "jrnl"
brew "krb5"
brew "leiningen"
brew "less"
brew "mas"
brew "memcached", restart_service: true
brew "mkcert"
brew "mysql"
brew "node", link: false
brew "openssl@3"
brew "postgresql", restart_service: true
brew "postgresql@10", restart_service: true
brew "python@3.8"
brew "redis", restart_service: true
brew "ruby-build"
brew "ruby-install"
brew "rust"
brew "sbt"
brew "scalastyle"
brew "sphinx-doc"
brew "starship"
brew "v8"
brew "v8@3.15"
brew "watch"
brew "watchman"
brew "yarn"
brew "youtube-dl"
brew "artsy/formulas/copy_env"
brew "artsy/formulas/deploy_pr"
brew "artsy/formulas/detect_secrets"
brew "artsy/formulas/elasticsearch@5.6"
brew "artsy/formulas/hokusai"
brew "git-duet/tap/git-duet"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community@4.0"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
brew "rbenv/tap/openssl@1.0"
brew "thoughtbot/formulae/rcm"
brew "vapor/tap/vapor"
cask "adoptopenjdk8"
cask "alfred"
cask "android-file-transfer"
cask "cyberduck"
cask "docker"
cask "finicky"
cask "fork"
cask "graphiql"
cask "hocus-focus"
cask "hyper"
cask "inkscape"
cask "insomnia"
cask "jasper"
cask "java"
cask "java8"
cask "kap"
cask "keycastr"
cask "meld"
cask "obs"
cask "pgadmin4"
cask "react-native-debugger"
cask "scroll-reverser"
cask "sensiblesidebuttons"
cask "soundflower"
cask "spectacle"
cask "spotify"
cask "transnomino"
cask "visual-studio-code"
cask "xquartz"
cask "zeplin"
mas "Flycut", id: 442160987
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perculia", id: 1462633284
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
