tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
brew "asdf"
brew "git-delta"
brew "jq"
brew "mas"
brew "python@3.9"
brew "rcm"
brew "starship"
cask "fork"
cask "insomnia"
cask "sensiblesidebuttons"
cask "spotify"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perculia", id: 1462633284
